import styled from "styled-components";
import { useSizeRatio } from "../../hooks/useSizeRatio"
import { motion } from "framer-motion";
import bot from '../../assets/images/botAvatar.png';

const DialogWrapper = styled(motion.div)`
    position: absolute;
    bottom: ${({ $bottom }) => $bottom}px;
    left: var(--spacing_x3);
    z-index: 10;
    transform-origin: 0% 0%;
    overflow: hidden;
    /* line-height: 100%; */
`;

const Dialog = styled.div`
    height:100%;
    width:100%;
    background-color: #4A4F4A;
`;

const Dialog0 = styled(Dialog)`
    clip-path:url(#bgblur_0_418_4507_clip_path);
`;

const Dialog1 = styled(Dialog)`
    clip-path:url('#bgblur_0_418_4489_clip_path');
`;

const Dialog2 = styled(Dialog)`
    clip-path:url(#bgblur_0_418_4625_clip_path);
`;

const Dialog3 = styled(Dialog)`
    clip-path:url(#bgblur_0_418_4784_clip_path);
`;

const Text = styled(motion.div)`
    position: absolute;
    top: ${({ $ratio }) => $ratio * 72}px;
    left: var(--spacing_x3);
    max-width: calc(100% - var(--spacing_x5));
`;

const Avatar = styled.div`
    position: absolute;
    top: ${({ $ratio }) => $ratio * 16}px;
    left: ${({ $ratio }) => $ratio * 17}px;   
    background: url(${bot}) no-repeat center center;
    background-size: contain;
    width: ${({ $ratio }) => $ratio * 48}px;
    height: ${({ $ratio }) => $ratio * 40}px;
`;

const config = {
    part0: {
        component: () => (
            <svg width="100%" height="100%" viewBox="0 0 374 244" fill="none" xmlns="http://www.w3.org/2000/svg">
            <foreignObject x="-80" y="-80" width="534" height="404"><Dialog0 xmlns="http://www.w3.org/1999/xhtml"></Dialog0></foreignObject><g data-figma-bg-blur-radius="80">
            <path d="M78.5 244L24 244C10.7452 244 9.39372e-07 233.255 2.09815e-06 220L-1.12846e-05 24.0001C-1.01258e-05 10.7453 10.7451 0.000105572 24 7.62135e-05L59.304 3.35236e-05C68.749 1.90905e-05 77.3158 5.53969 81.191 14.1531L92.4561 39.1921C96.3312 47.8055 104.898 53.3452 114.343 53.3452L350 53.3452C363.255 53.3452 374 64.0904 374 77.3452L374 220C374 233.255 363.255 244 350 244L78.5 244Z" fill="#4A4F4A" fillOpacity="0.25"/>
            <path d="M350 243.5L24 243.5C11.0213 243.5 0.500001 232.979 0.500002 220L0.500019 24C0.500078 11.0213 11.0214 0.499998 24 0.499969L59.3037 0.499972C68.5519 0.499958 76.941 5.92442 80.7354 14.3584L92 39.3974C95.9559 48.1902 104.701 53.8456 114.343 53.8457L350 53.8457C362.979 53.8457 373.5 64.367 373.5 77.3457L373.5 220C373.5 232.979 362.979 243.5 350 243.5Z" stroke="white" strokeOpacity="0.2"/>
            </g>
            <defs>
            <clipPath id="bgblur_0_418_4507_clip_path" transform="translate(80 80)"><path d="M78.5 244L24 244C10.7452 244 9.39372e-07 233.255 2.09815e-06 220L-1.12846e-05 24.0001C-1.01258e-05 10.7453 10.7451 0.000105572 24 7.62135e-05L59.304 3.35236e-05C68.749 1.90905e-05 77.3158 5.53969 81.191 14.1531L92.4561 39.1921C96.3312 47.8055 104.898 53.3452 114.343 53.3452L350 53.3452C363.255 53.3452 374 64.0904 374 77.3452L374 220C374 233.255 363.255 244 350 244L78.5 244Z"/>
            </clipPath></defs>
            </svg>
        ),
        text: () => (
            <p>
                Прежде чем конструировать идеальный карьерный трек, познакомься с главным инструментом — <b>Соединителем</b>. Наша команда инноваторов тестировала новые подходы и оставила для тебя несколько <b>готовых модулей</b>. Не пропадать же добру! Это твой базовый набор для старта. Теперь твоя очередь творить!
            </p>        
        ),
        bottom: 196,
        width: 374,
        height: 244
    },
    part1: {
        component: () => (
            <svg width="100%" height="100%" viewBox="0 0 341 263" fill="none" xmlns="http://www.w3.org/2000/svg">
            <foreignObject x="-80" y="-80" width="501" height="423"><Dialog1 xmlns="http://www.w3.org/1999/xhtml" ></Dialog1></foreignObject><g data-figma-bg-blur-radius="80">
            <path d="M78.5 263L24 263C10.7452 263 9.39372e-07 252.255 2.09815e-06 239L-9.62354e-06 24.0001C-8.46477e-06 10.7453 10.7451 9.31985e-05 24 9.43573e-05L59.304 3.64085e-05C68.749 6.71664e-06 77.3158 5.53968 81.191 14.1531L92.4561 39.1921C96.3312 47.8056 104.898 53.3452 114.343 53.3452L317 53.3452C330.255 53.3452 341 64.0904 341 77.3452L341 239C341 252.255 330.255 263 317 263L78.5 263Z" fill="#4A4F4A" fillOpacity="0.25"/>
            <path d="M317 262.5L24 262.5C11.0213 262.5 0.500001 251.979 0.500002 239L0.500021 24C0.50008 11.0213 11.0214 0.499971 24 0.499972L59.3037 0.499975C68.5519 0.499946 76.941 5.9244 80.7354 14.3584L92 39.3974C95.9559 48.1902 104.701 53.8456 114.343 53.8457L317 53.8457C329.979 53.8457 340.5 64.367 340.5 77.3457L340.5 239C340.5 251.979 329.979 262.5 317 262.5Z" stroke="white" strokeOpacity="0.2"/>
            </g>
            <defs>
            <clipPath id="bgblur_0_418_4489_clip_path" transform="translate(80 80)"><path d="M78.5 263L24 263C10.7452 263 9.39372e-07 252.255 2.09815e-06 239L-9.62354e-06 24.0001C-8.46477e-06 10.7453 10.7451 9.31985e-05 24 9.43573e-05L59.304 3.64085e-05C68.749 6.71664e-06 77.3158 5.53968 81.191 14.1531L92.4561 39.1921C96.3312 47.8056 104.898 53.3452 114.343 53.3452L317 53.3452C330.255 53.3452 341 64.0904 341 77.3452L341 239C341 252.255 330.255 263 317 263L78.5 263Z"/>
            </clipPath></defs>
            </svg>
        ),
        text: () => (
            <p>
                Ах да, совсем забыл про инструкцию! Всё просто: чтобы запустить Соединитель, нужно скомбинировать два компонента. Нажми на элемент, чтобы перетащить его внутрь, и положи другой сверху. Мы думали назвать его «Комбинатор карьерных возможностей», но это слово почему‑то уже заняла кофемашина.
            </p>
        ),
        bottom: 196,
        width: 341,
        height: 263
    },
    part2: {
        component: () => (
            <svg width="100%" height="100%" viewBox="0 0 348 244" fill="none" xmlns="http://www.w3.org/2000/svg">
                <foreignObject x="-80" y="-80" width="508" height="404"><Dialog2 xmlns="http://www.w3.org/1999/xhtml" /></foreignObject><g data-figma-bg-blur-radius="80">
                    <path d="M78.5 244L24 244C10.7452 244 9.39372e-07 233.255 2.09815e-06 220L-1.12846e-05 24.0001C-1.01258e-05 10.7453 10.7451 0.000107845 24 7.84865e-05L59.304 3.57966e-05C68.749 2.13635e-05 77.3158 5.53969 81.191 14.1531L92.4561 39.1921C96.3312 47.8056 104.898 53.3452 114.343 53.3452L324 53.3452C337.255 53.3452 348 64.0904 348 77.3452L348 220C348 233.255 337.255 244 324 244L78.5 244Z" fill="#4A4F4A" fillOpacity="1" />
                    <path d="M324 243.5L24 243.5C11.0213 243.5 0.500001 232.979 0.500002 220L0.500019 24C0.500078 11.0213 11.0214 0.5 24 0.499972L59.3037 0.499975C68.5519 0.499961 76.941 5.92442 80.7354 14.3584L92 39.3974C95.9559 48.1902 104.701 53.8456 114.343 53.8457L324 53.8457C336.979 53.8457 347.5 64.367 347.5 77.3457L347.5 220C347.5 232.979 336.979 243.5 324 243.5Z" stroke="white" strokeOpacity="0.2" />
                </g>
                <defs>
                    <clipPath id="bgblur_0_418_4625_clip_path" transform="translate(80 80)"><path d="M78.5 244L24 244C10.7452 244 9.39372e-07 233.255 2.09815e-06 220L-1.12846e-05 24.0001C-1.01258e-05 10.7453 10.7451 0.000107845 24 7.84865e-05L59.304 3.57966e-05C68.749 2.13635e-05 77.3158 5.53969 81.191 14.1531L92.4561 39.1921C96.3312 47.8056 104.898 53.3452 114.343 53.3452L324 53.3452C337.255 53.3452 348 64.0904 348 77.3452L348 220C348 233.255 337.255 244 324 244L78.5 244Z" />
                    </clipPath></defs>

            </svg>
        ),
        text: () => (
            <p>
                Простое правило: если Соединитель переполнен, скинь всё <b>в корзину.</b> Не ищи в ней скрытый функционал. Предложение заменить её на «чёрную дыру» для инновационного апгрейда тимлид проигнорировал. Говорит: «Из соображений сохранения вселенной».
            </p>       
        ),
        bottom: 196,
        width: 348,
        height: 244
    },
    part3: {
        component: () => (
            <svg width="100%" height="100%" viewBox="0 0 357 358" fill="none" xmlns="http://www.w3.org/2000/svg">
                <foreignObject x="-80" y="-79.9999" width="517" height="518"><Dialog3 xmlns="http://www.w3.org/1999/xhtml" /></foreignObject><g data-figma-bg-blur-radius="80">
                    <path d="M78.5 358L24 358C10.7452 358 9.39372e-07 347.255 2.09815e-06 334L-1.31838e-06 24.0001C-1.59608e-07 10.7453 10.7451 0.000122317 24 0.000123476L59.304 6.55273e-05C68.749 3.58355e-05 77.3159 5.53971 81.191 14.1531L92.4561 39.1922C96.3313 47.8056 104.898 53.3453 114.343 53.3453L333 53.3452C346.255 53.3452 357 64.0904 357 77.3452L357 334C357 347.255 346.255 358 333 358L78.5 358Z" fill="#4A4F4A" fillOpacity="0.2" />
                    <path d="M333 357.5L24 357.5C11.0213 357.5 0.500001 346.979 0.500002 334L0.500029 24C0.500096 11.0214 11.0214 0.5 24 0.500001L59.3037 0.500004C68.5519 0.499975 76.941 5.92442 80.7354 14.3584L92 39.3975C95.9559 48.1902 104.701 53.8456 114.343 53.8457L333 53.8448C345.979 53.8448 356.5 64.3671 356.5 77.3457L356.5 334C356.5 346.979 345.979 357.5 333 357.5Z" stroke="white" strokeOpacity="0.25" />
                </g>
                <defs>
                    <clipPath id="bgblur_0_418_4784_clip_path" transform="translate(80 79.9999)"><path d="M78.5 358L24 358C10.7452 358 9.39372e-07 347.255 2.09815e-06 334L-1.31838e-06 24.0001C-1.59608e-07 10.7453 10.7451 0.000122317 24 0.000123476L59.304 6.55273e-05C68.749 3.58355e-05 77.3159 5.53971 81.191 14.1531L92.4561 39.1922C96.3313 47.8056 104.898 53.3453 114.343 53.3453L333 53.3452C346.255 53.3452 357 64.0904 357 77.3452L357 334C357 347.255 346.255 358 333 358L78.5 358Z" />
                    </clipPath></defs>

            </svg>
        ),
        text: () => (
            <p>
               Отличный вопрос! Я покопался в данных и выяснил: единственный способ найти идеальный карьерный трек «X5» — собрать все бизнес-юниты вместе. Как их найти, мы уже знаем, поэтому оставляю чек-лист, чтобы тебе было легче. Правда, часть элементов придётся искать самому. Следи за шкалой прогресса: КАЖДАЯ удачная комбинация приближает тебя к разблокировке трека «X5».{'\n'}В общем, ты понял задачу. Меня ждёт нетворкинг в режиме «вне сети». Удачи — ты справишься!                
            </p>
        ),
        bottom: 196,
        width: 357,
        height: 358
    },
};

export const BotDialog = ({ part }) => {
    const ratio = useSizeRatio();

    const dialog = config?.[`part${part}`] ?? {};

    return (
        <DialogWrapper
            $ratio={ratio}
            $bottom={dialog.bottom * ratio}
            initial={{ opacity: 0, height: 0, width: 0, 'white-space': 'nowrap' }}
            animate={{ opacity: 1, height: dialog.height * ratio + 'px', width: config[`part${part}`].width * ratio + 'px', 'white-space': 'break-spaces' }}
            exit={{ opacity: 0, height: 0, width: 0, 'white-space': 'nowrap' }}
            transition={{ duration: 0.3 }}
        >
            <Avatar $ratio={ratio} />
            {dialog.component()}
            <Text
                $ratio={ratio}
                initial={{ opacity: 0 }}
                animate={{ opacity: 1 }}
                exit={{ opacity: 0 }}
                transition={{ delay: 0.1, duration: 0.1 }}
            >
                {dialog.text()}
            </Text>
        </DialogWrapper>

    )
}