// Гибкость + Технологичность → Agile-подход
// Работа + Agile-подход → X5 Tech
// Гибкость + Креативность → Творческая свобода
// Работа + Творческая свобода → X5 Media
// Гибкость + Вовлечённость → Видимый результат
// Работа + Видимый результат → Магазины X5
// Гибкость + Инновационность → Динамичная среда
// Работа + Динамичная среда → X5 Digital
// Гибкость + Эффективность → Автоматизация
// Работа + Автоматизация → X5 Transport
// Гибкость + Кооперативность → Комплексный подход
// Работа + Комплексный подход → X5 Поддержка бизнеса
// Гибкость + Адаптивность → Нестандартные решения
// Работа + Нестандартные решения → X5 Import
// Гибкость + Клиентоцентричность → Фокус на пользователях
// Работа + Фокус на пользователях → Х5 Клуб и Сервис «Пакет»
// Гибкость + Неординарность → Тренд-watching
// Работа + Тренд-watching → Много лосося
// Гибкость + Оперативность → Слаженность процессов
// Работа + Слаженность процессов → 5Post
// Гибкость + Ответственность → Надёжность
// Работа + Надёжность → Х5 Еда
import creativity from '../assets/images/creativity.png';
import effect from '../assets/images/effect.png';

export const elements = [
    {
        id: 'flexibility',
        name: 'Гибкость',
        icon: '',
        picture: '',
        page: 1,
    },
    {
        id: 'work',
        name: 'Работа',
        icon: '',
        picture: '',
        page: 1,
    },
    {
        id: 'tech',
        name: 'Технологичность',
        icon: '',
        picture: '',
        page: 1,
    },
    {
        id: 'creativity',
        name: 'Креативность',
        icon: '',
        picture: creativity,
        svgElement: () => (<svg width="100%" height="100%" viewBox="0 0 70 80" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M31.3271 2.01562C32.664 0.685861 34.7283 -0.421609 37.0859 0.157227L37.5615 0.294922C39.7642 1.04043 40.9277 2.91647 41.4824 4.2998C42.5945 7.074 42.5506 10.878 40.9355 14.1973C41.7345 14.4369 42.5182 14.721 43.2803 15.042C43.6689 13.3699 44.4693 11.5784 45.5322 9.96387C46.7823 8.06547 48.5751 6.26064 50.8916 5.61426C52.1254 5.27014 53.5225 5.26316 54.8779 5.82129C56.2182 6.37345 57.2001 7.34651 57.8672 8.41992L57.8828 8.44629L57.8975 8.47168L58.0098 8.66895L58.0244 8.69531L58.0391 8.72266C58.8148 10.2315 58.4418 11.7024 58.3154 12.1611C58.1167 12.882 57.7921 13.5536 57.4951 14.0898C56.8845 15.1919 56.0241 16.3723 55.1484 17.4229C54.2664 18.481 53.2481 19.5509 52.2529 20.3945C52.0186 20.5932 51.7659 20.7941 51.502 20.9883C51.6981 21.2234 51.8858 21.4651 52.0693 21.71C52.9849 20.8267 54.1016 20.178 55.1621 19.7539L55.1777 19.7471L55.6123 19.5801L55.627 19.5732C57.9311 18.7124 60.3296 18.2605 62.3975 18.3926C63.4702 18.4612 64.8047 18.7095 65.9902 19.4619C67.339 20.3184 68.4305 21.8277 68.4307 23.8203C68.4304 27.086 65.8586 29.1185 64.1172 30.0703C62.3246 31.05 60.1123 31.6608 57.832 31.7852C57.914 31.7942 57.9968 31.8016 58.0781 31.8115C59.6347 32.0007 61.48 32.3965 63.4053 32.9482L64.2344 33.1943L64.2568 33.2002L64.2764 33.207L64.5244 33.291L64.5469 33.2998L64.5723 33.3086C66.2398 33.9377 67.2417 35.218 67.7656 36.3613C68.3151 37.5608 68.4719 38.8495 68.3955 39.9766C68.32 41.0891 67.9927 42.3929 67.2021 43.5352C66.3609 44.7502 64.8517 45.9194 62.7471 45.9199C61.4652 45.9199 60.1012 45.5217 59.0811 45.1631C57.9515 44.766 56.7612 44.2398 55.6777 43.6816C54.6623 43.1584 53.6319 42.5499 52.7812 41.9238C52.374 42.8268 51.9255 43.7426 51.4297 44.667C49.2485 48.7326 48.3381 52.0346 48.3379 54.4727C48.3379 56.6504 48.1297 58.6458 47.3555 60.5996C46.6777 62.3098 45.6623 63.7463 44.418 65.1445L44.4102 65.1514L44.4033 65.1602L43.8828 65.7285L43.8711 65.7422C43.5754 66.0571 43.2712 66.3663 42.959 66.667H67.0371C68.6735 66.6671 70 67.9935 70 69.6299V77.0371C69.9999 78.6734 68.6734 79.9999 67.0371 80H2.96289C1.32655 80 5.28256e-05 78.6734 0 77.0371V69.6299C0 67.9935 1.32651 66.667 2.96289 66.667H27.2656C26.9104 66.3222 26.5653 65.9661 26.2314 65.6025C24.7083 63.9438 23.453 62.3136 22.6982 60.2646C21.9519 58.2376 21.8261 56.1521 21.8682 53.8369C21.922 50.8579 21.2123 48.0977 18.7432 43.4688C18.3662 42.762 18.0103 42.0824 17.6777 41.4277C17.5405 41.5515 17.4069 41.6665 17.2793 41.7695C16.1703 42.6643 14.7612 43.4144 13.4336 43.9697C12.0926 44.5306 10.566 45.0035 9.13281 45.2021C8.4229 45.3005 7.58174 45.3545 6.72852 45.2402C5.93174 45.1335 4.66394 44.8185 3.62012 43.7803C1.33671 41.5082 1.33824 38.4385 2.59961 36.1719C3.78733 34.0377 6.0067 32.5834 8.50684 32.0977L9.30566 31.9512C11.1624 31.6346 12.9748 31.4962 14.5684 31.7979C14.6512 31.8135 14.7346 31.833 14.8184 31.8516C14.8221 31.745 14.8273 31.6389 14.834 31.5332C14.7794 31.5388 14.726 31.5491 14.6729 31.5537C13.3252 31.6707 11.8086 31.557 10.2148 31.2598C7.90678 30.8286 5.49556 30.1202 3.85254 28.6943C2.93197 27.895 2.07215 26.7071 1.87012 25.123C1.67287 23.5736 2.18177 22.2375 2.79004 21.2588L2.7998 21.2412L2.81152 21.2236L2.94434 21.0225L2.96973 20.9854C3.91705 19.6449 5.27695 18.9757 6.38477 18.6543C7.5886 18.3054 8.85499 18.2518 10.0078 18.3477C12.3034 18.5388 14.8623 19.3834 16.9805 20.8594C17.4853 21.2111 18.0041 21.6243 18.4863 22.0986C18.7242 21.7307 18.9713 21.3731 19.2275 21.0254C18.2351 20.5205 17.3205 19.8466 16.5508 19.165C15.5103 18.2437 14.5101 17.1107 13.7432 15.8877C13.0243 14.7411 12.2607 13.1209 12.2607 11.3105C12.2609 9.7812 12.7114 7.87932 14.335 6.55762C15.969 5.22765 17.905 5.20576 19.2891 5.52832C21.9512 6.14905 24.2943 8.29968 25.8076 10.8477C26.5389 12.0794 27.2208 13.4018 27.5488 14.7383C28.291 14.4547 29.0589 14.2075 29.8525 13.9932C29.7315 13.7248 29.6261 13.46 29.5361 13.2041C29.1133 12.0012 28.9041 10.7068 28.8633 9.47363C28.8224 8.23873 28.9472 6.93328 29.2842 5.7041C29.6098 4.5169 30.2101 3.12729 31.3271 2.01562ZM55.3242 31.7168C55.3664 31.7132 55.4086 31.7099 55.4492 31.707C55.4757 31.7051 55.5027 31.7038 55.5293 31.7021C55.461 31.6918 55.3924 31.6809 55.3242 31.6689C55.3241 31.6848 55.3244 31.701 55.3242 31.7168Z" fill="#062A12" fill-opacity="0.5"/>
</svg>),
        page: 1,
        width: 60,
        height: 69,
        top: 3.5,
    },
    {
        id: 'engagement',
        name: 'Вовлечённость',
        icon: '',
         picture: '',
        page: 1,
    },
    {
        id: 'innovation',
        name: 'Инновационность',
        icon: '',
         picture: '',
        page: 1,
    },
    {
        id: 'effectivity',
        name: 'Эффективность',
        icon: '',
        picture: effect,
        svgElement: () => (<svg width="100%" height="100%" viewBox="0 0 77 80" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M61.3047 0.0106496C62.2319 -0.0335688 63.3795 0.0437131 64.4805 0.553618C69.8737 3.05311 66.9864 13.8365 66.2295 18.0019C66.0425 19.0307 65.8457 20.0907 65.4268 21.0556C65.5769 27.5138 65.6332 33.9916 66.0176 40.4394C66.0702 41.3218 66.1521 42.1879 66.3252 43.0536C68.3703 44.3078 70.51 45.1493 71.5479 47.5312C73.5154 52.0484 72.8545 60.57 69.2852 63.7216C67.9925 64.8626 66.4225 65.8362 64.6797 66.6669H74.0371C75.6734 66.667 76.9999 67.9935 77 69.6298V77.037C77 78.6734 75.6734 79.9998 74.0371 79.9999H2.96289C1.32657 79.9998 0 78.6734 0 77.037V69.6298C6.20628e-05 67.9935 1.3266 66.667 2.96289 66.6669H15.2031C12.9852 65.7073 11.0831 64.5591 9.73242 62.8671C6.35591 58.6362 6.25166 49.5408 9.69922 45.3075C11.7592 42.7786 14.895 41.8946 17.9092 41.08C18.5396 40.8935 16.6138 40.7769 16.0352 40.4648C14.6036 39.6591 13.1878 38.664 12.2002 37.3427C8.05793 31.7981 15.5245 25.7242 18.9375 22.3124C22.1549 19.096 27.7121 12.0374 33.3564 13.7362L34.2734 14.0605C36.6715 15.0192 38.7324 16.5721 40.7168 18.1942C42.2437 16.3986 43.8385 14.6365 45.2617 12.7558C44.7735 12.2364 44.2954 11.7028 43.9658 11.0644C43.5979 10.3515 43.2352 9.16334 43.7041 7.80167C44.4726 5.57338 46.8813 4.69185 48.8809 3.9003C50.3094 3.33479 52.2968 2.60097 54.8809 1.62979C57.2679 0.732985 59.4692 0.0983123 61.3047 0.0106496Z" fill="#062A12" fill-opacity="0.5"/>
</svg>
),
        page: 1,
        width: 60,
        height: 66,
        left: 51,
        top: 3.5,
    },
    {
        id: 'cooperativity',
        name: 'Кооперативность',
        icon: '',
         picture: '',
        page: 1,
    },
    {
        id: 'adaptivity',
        name: 'Адаптивность',
        icon: '',
         picture: '',
        page: 1,
    },
    {
        id: 'clients',
        name: 'Клиентоцентричность',
        icon: '',
         picture: '',
        page: 1,
    },
    {
        id: 'unordinar',
        name: 'Неординарность',
        icon: '',
         picture: '',
        page: 1,
    },
    {
        id: 'operativity',
        name: 'Оперативность',
        icon: '',
         picture: '',
        page: 1,
    },
    {
        id: 'respons',
        name: 'Ответственность',
        icon: '',
         picture: '',
        page: 1,
    },
    {
        id: 'agile',
        name: 'Agile-подход',
        icon: '',
         picture: '',
        page: 2,
    },
    {
        id: 'art',
        name: 'Творческая свобода',
        icon: '',
        picture: '',
        page: 2,
    },
    {
        id: 'result',
        name: 'Видимый результат',
        icon: '',
        picture: '',
        page: 2,
    },
    {
        id: 'dynamic',
        name: 'Динамичная среда',
        icon: '',
        picture: '',
        page: 2,
    },
    {
        id: 'automization',
        name: 'Автоматизация',
        icon: '',
        picture: '',
        page: 2,
    },
    {
        id: 'complex',
        name: 'Комплексный подход',
        icon: '',
        picture: '',
        page: 2,
    },
    {
        id: 'decision',
        name: 'Нестандартные решения',
        icon: '',
        picture: '',
        page: 2,
    },
    {
        id: 'focus',
        name: 'Фокус на пользователях',
        icon: '',
        picture: '',
        page: 2,
    },
    {
        id: 'trend',
        name: 'Тренд-watching',
        icon: '',
        picture: '',
        page: 2,
    },
    {
        id: 'process',
        name: 'Слаженность процессов',
        icon: '',
        picture: '',
        page: 2,
    },
    {
        id: 'reliability',
        name: 'Надёжность',
        icon: '',
        picture: '',
        page: 2,
    },
    {
        id: 'X5Tech',
        name: 'X5 Tech',
        icon: '',
        picture: '',
        page: 3,
    },
    {
        id: 'X5Media',
        name: 'X5 Media',
        icon: '',
        picture: '',
        page: 3,
    },
    {
        id: 'X5Stores',
        name: 'Магазины X5',
        icon: '',
        picture: '',
        page: 3,
    },
    {
        id: 'X5Digital',
        name: 'X5 Digital',
        icon: '',
        picture: '',
        page: 3,
    },
    {
        id: 'X5Transport',
        name: 'X5 Transport',
        icon: '',
        picture: '',
        page: 3,
    },
    {
        id: 'X5Business',
        name: 'X5 Поддержка бизнеса',
        icon: '',
        picture: '',
        page: 3,
    },
    {
        id: 'X5Import',
        name: 'X5 Import',
        icon: '',
        picture: '',
        page: 3,
    },
    {
        id: 'X5Club',
        name: 'Х5 клуб и Пакет',
        icon: '',
        picture: '',
        page: 3,
    },
    {
        id: 'salmon',
        name: 'Много лосося',
        icon: '',
        picture: '',
        page: 3,
    },
    {
        id: '5Post',
        name: '5Post',
        icon: '',
        picture: '',
        page: 3,
    },
    {
        id: 'X5Food',
        name: 'Х5 Еда',
        icon: '',
        picture: '',
        page: 3,
    }
];

export const combinations = {
    'flexibility+tech': 'agile',
    'flexibility+creativity': 'art',
    'flexibility+engagement': 'result',
    'flexibility+innovation': 'dynamic',
    'flexibility+effectivity': 'automization',
    'flexibility+cooperativity': 'complex',
    'flexibility+adaptivity': 'decision',
    'flexibility+clients': 'focus',
    'flexibility+unordinar': 'trend',
    'flexibility+operativity': 'process',
    'flexibility+respons': 'reliability',  
    'work+agile': 'X5Tech',
    'work+art': 'X5Media',
    'work+result': 'X5Stores',
    'work+dynamic': 'X5Digital',
    'work+automization': 'X5Transport',
    'work+complex': 'X5Business',
    'work+decision': 'X5Import',
    'work+focus': 'X5Club',
    'work+trend': 'salmon',
    'work+process': '5Post',
    'work+reliability': 'X5Food',
}