import salmon from '../assets/images/logoSalmon.svg';
import logo5 from '../assets/images/logo5.svg';
import logoPaket from '../assets/images/logoPaket.svg';
import logoPost from '../assets/images/logoPost.svg';
import styled from 'styled-components';

const Dialog = styled.div`
    width: 100%;
    height: 100%;
    clip-path:url(${({ id }) => id});
`;

export const prizes = [
    {
        id: 'salmon',
        promo: 'ML5STDNS',
        logo: salmon,
        title: 'Промокод Много лосося',
        text: () => (
            <p>
                Держи промокод <b>на скидку 10%</b> на заказ от 2000 руб.
            </p>
        ),
        rules: ['Скачайте мобильное приложение «Много лосося»;', 'Соберите корзину на сумму от 2000 рублей;', 'Перейдите в корзину и добавить код в поле «Промокод».'],
        restrictions: ['Скидка действует только на заказ в мобильном приложения «Много лосося»', 'Промокод можно применить только один раз', 'Предложение не суммируется с другими акциями', 'Приложение ограниченно минимально суммой заказа – 2000 рублей', 'Акция действует для Москвы и Санкт-Петербурга'],
        wrapper: () => (
            <svg width="100%" height="100%" viewBox="0 0 380 824" preserveAspectRatio="xMidYMin meet" fill="none" xmlns="http://www.w3.org/2000/svg">
                <foreignObject x="-10" y="-9.99997" width="400" height="844"><Dialog xmlns="http://www.w3.org/1999/xhtml" id="#bgblur_0_479_593_clip_path"></Dialog></foreignObject><g data-figma-bg-blur-radius="10">
                    <path d="M276.8 824C268.367 824 260.552 819.574 256.216 812.341L224.931 760.159C220.595 752.926 212.78 748.5 204.347 748.5L24 748.5C10.7452 748.5 7.5398e-06 737.755 8.69857e-06 724.5L3.94206e-05 24C4.05794e-05 10.7452 10.7452 2.87539e-05 24 2.99126e-05L129.064 3.90977e-05C136.483 3.97462e-05 143.484 3.43034 148.03 9.29228L171.617 39.7078C176.163 45.5697 183.165 49 190.583 49L356 49.0001C369.255 49.0001 380 59.7452 380 73.0001L380 800C380 813.255 369.255 824 356 824L276.8 824Z" fill="#083617" />
                    <path d="M356 823.5L276.8 823.5C268.542 823.5 260.891 819.166 256.645 812.084L225.36 759.902C220.934 752.519 212.956 748 204.347 748L24 748C11.0213 748 0.500032 737.479 0.500009 724.5L0.50007 24C0.500071 11.0213 11.0214 0.500029 24.0001 0.50003L129.065 0.500039C136.328 0.500049 143.184 3.85887 147.635 9.59867L171.223 40.0147C175.863 45.9984 183.011 49.5 190.583 49.5L356 49.5001C368.979 49.5001 379.5 60.0214 379.5 73.0001L379.5 800C379.5 812.979 368.979 823.5 356 823.5Z" stroke="#60AF2C" strokeOpacity="0.25" />
                </g>
                <defs>
                    <clipPath id="bgblur_0_479_593_clip_path" transform="translate(10 9.99997)"><path d="M276.8 824C268.367 824 260.552 819.574 256.216 812.341L224.931 760.159C220.595 752.926 212.78 748.5 204.347 748.5L24 748.5C10.7452 748.5 7.5398e-06 737.755 8.69857e-06 724.5L3.94206e-05 24C4.05794e-05 10.7452 10.7452 2.87539e-05 24 2.99126e-05L129.064 3.90977e-05C136.483 3.97462e-05 143.484 3.43034 148.03 9.29228L171.617 39.7078C176.163 45.5697 183.165 49 190.583 49L356 49.0001C369.255 49.0001 380 59.7452 380 73.0001L380 800C380 813.255 369.255 824 356 824L276.8 824Z" />
                    </clipPath></defs>
            </svg>

        )
    },
    {
        id: '5ka',
        promo: 'ТС5',
        logo: logo5,
        title: 'Промокод Пятёрочка Доставка',
        text: () => (
            <p>
                Держи промокод <b>на скидку 500 рублей</b> при оформлении доставки на 1 500 рублей.
            </p>
        ),
        expire: '31.12.2025',
        wrapper: () => (
            <svg width="100%" height="100%" viewBox="0 0 380 587" fill="none" xmlns="http://www.w3.org/2000/svg">
                <foreignObject x="-10" y="-9.99997" width="400" height="607"><Dialog xmlns="http://www.w3.org/1999/xhtml" id="#bgblur_0_485_663_clip_path"></Dialog></foreignObject><g data-figma-bg-blur-radius="10">
                    <path d="M276.8 587C268.367 587 260.552 582.574 256.216 575.341L224.931 523.159C220.595 515.926 212.78 511.5 204.347 511.5L24 511.5C10.7452 511.5 7.53979e-06 500.755 8.69857e-06 487.5L1.87014e-05 24C1.98602e-05 10.7452 10.7452 2.87539e-05 24 2.99126e-05L129.064 3.90977e-05C136.483 3.97462e-05 143.484 3.43034 148.03 9.29228L171.617 39.7078C176.163 45.5697 183.165 49 190.583 49L356 49.0001C369.255 49.0001 380 59.7452 380 73.0001L380 563C380 576.255 369.255 587 356 587L276.8 587Z" fill="#083617" />
                    <path d="M356 586.5L276.8 586.5C268.542 586.5 260.891 582.166 256.645 575.084L225.36 522.902C220.934 515.519 212.956 511 204.347 511L24 511C11.0213 511 0.500028 500.479 0.500009 487.5L0.500049 24C0.50005 11.0213 11.0214 0.500029 24.0001 0.50003L129.065 0.500039C136.328 0.500049 143.184 3.85887 147.635 9.59867L171.223 40.0147C175.863 45.9984 183.011 49.5 190.583 49.5L356 49.5001C368.979 49.5001 379.5 60.0214 379.5 73.0001L379.5 563C379.5 575.979 368.979 586.5 356 586.5Z" stroke="#60AF2C" strokeOpacity="0.25" />
                </g>
                <defs>
                    <clipPath id="bgblur_0_485_663_clip_path" transform="translate(10 9.99997)"><path d="M276.8 587C268.367 587 260.552 582.574 256.216 575.341L224.931 523.159C220.595 515.926 212.78 511.5 204.347 511.5L24 511.5C10.7452 511.5 7.53979e-06 500.755 8.69857e-06 487.5L1.87014e-05 24C1.98602e-05 10.7452 10.7452 2.87539e-05 24 2.99126e-05L129.064 3.90977e-05C136.483 3.97462e-05 143.484 3.43034 148.03 9.29228L171.617 39.7078C176.163 45.5697 183.165 49 190.583 49L356 49.0001C369.255 49.0001 380 59.7452 380 73.0001L380 563C380 576.255 369.255 587 356 587L276.8 587Z" />
                    </clipPath></defs>
            </svg>

        )
    },
    {
        id: '5post',
        promo: 'ФЕСТИВАЛЬ',
        logo: logoPost,
        title: 'Промокод 5Post',
        text: () => (
            <p>
                Держи промокод на скидку 15% на доставку посылок по всей РФ.
            </p>
        ),
        expire: '31.10.2025',
        wrapper: () => (
            <svg width="100%" height="100%" viewBox="0 0 380 568" fill="none" xmlns="http://www.w3.org/2000/svg">
                <foreignObject x="-10" y="-10" width="400" height="588"><Dialog xmlns="http://www.w3.org/1999/xhtml" id="#bgblur_0_485_702_clip_path"></Dialog></foreignObject><g data-figma-bg-blur-radius="10">
                    <path d="M276.8 568C268.367 568 260.552 563.574 256.216 556.341L224.931 504.159C220.595 496.926 212.78 492.5 204.347 492.5L24 492.5C10.7452 492.5 7.53979e-06 481.755 8.69857e-06 468.5L1.70404e-05 24C1.81992e-05 10.7451 10.7452 -3.22813e-05 24 -3.11225e-05L129.064 -2.19375e-05C136.483 -2.1289e-05 143.484 3.43028 148.03 9.29222L171.617 39.7077C176.163 45.5697 183.165 49 190.583 49L356 49C369.255 49 380 59.7451 380 73L380 544C380 557.255 369.255 568 356 568L276.8 568Z" fill="#083617" />
                    <path d="M356 567.5L276.8 567.5C268.542 567.5 260.891 563.166 256.645 556.084L225.36 503.902C220.934 496.519 212.956 492 204.347 492L24 492C11.0213 492 0.500028 481.479 0.500009 468.5L0.500048 24C0.500049 11.0213 11.0214 0.499968 24 0.499969L129.065 0.499978C136.328 0.499988 143.184 3.85881 147.635 9.59861L171.223 40.0146C175.863 45.9984 183.011 49.5 190.583 49.5L356 49.5C368.979 49.5 379.5 60.0213 379.5 73L379.5 544C379.5 556.979 368.979 567.5 356 567.5Z" stroke="#60AF2C" strokeOpacity="0.25" />
                </g>
                <defs>
                    <clipPath id="bgblur_0_485_702_clip_path" transform="translate(10 10)"><path d="M276.8 568C268.367 568 260.552 563.574 256.216 556.341L224.931 504.159C220.595 496.926 212.78 492.5 204.347 492.5L24 492.5C10.7452 492.5 7.53979e-06 481.755 8.69857e-06 468.5L1.70404e-05 24C1.81992e-05 10.7451 10.7452 -3.22813e-05 24 -3.11225e-05L129.064 -2.19375e-05C136.483 -2.1289e-05 143.484 3.43028 148.03 9.29222L171.617 39.7077C176.163 45.5697 183.165 49 190.583 49L356 49C369.255 49 380 59.7451 380 73L380 544C380 557.255 369.255 568 356 568L276.8 568Z" />
                    </clipPath></defs>
            </svg>

        )
    },
    {
        id: '5paket',
        promo: 'PAKET2025',
        logo: logoPaket,
        title: 'Промокод Сервис Пакет',
        text: () => (
            <p>
                Держи промокод на первый месяц за 1 рубль, далее 199 рублей в месяц.
            </p>
        ),
        expire: '31.12.2025 включительно.',
        attention: 'Промокод действует для новых пользователей сервиса «Пакет», и пользователей, у которых ранее был подключен сервис «Пакет», но не было включено автопродление и сервис был отключен.',
        wrapper: () => (
            <svg width="100%" height="100%" viewBox="0 0 380 640" fill="none" xmlns="http://www.w3.org/2000/svg">
                <foreignObject x="-10" y="-9.99997" width="400" height="660"><Dialog xmlns="http://www.w3.org/1999/xhtml" id="#bgblur_0_485_739_clip_path"></Dialog></foreignObject><g data-figma-bg-blur-radius="10">
                    <path d="M276.8 640C268.367 640 260.552 635.574 256.216 628.341L224.931 576.159C220.595 568.926 212.78 564.5 204.347 564.5L24 564.5C10.7452 564.5 7.53979e-06 553.755 8.69857e-06 540.5L2.33349e-05 24C2.44936e-05 10.7452 10.7452 2.87539e-05 24 2.99126e-05L129.064 3.90977e-05C136.483 3.97462e-05 143.484 3.43034 148.03 9.29228L171.617 39.7078C176.163 45.5697 183.165 49 190.583 49L356 49.0001C369.255 49.0001 380 59.7452 380 73.0001L380 616C380 629.255 369.255 640 356 640L276.8 640Z" fill="#083617" />
                    <path d="M356 639.5L276.8 639.5C268.542 639.5 260.891 635.166 256.645 628.084L225.36 575.902C220.934 568.519 212.956 564 204.347 564L24 564C11.0213 564 0.500028 553.479 0.500009 540.5L0.500054 24C0.500055 11.0213 11.0214 0.500029 24.0001 0.50003L129.065 0.500039C136.328 0.500049 143.184 3.85887 147.635 9.59867L171.223 40.0147C175.863 45.9984 183.011 49.5 190.583 49.5L356 49.5001C368.979 49.5001 379.5 60.0214 379.5 73.0001L379.5 616C379.5 628.979 368.979 639.5 356 639.5Z" stroke="#60AF2C" strokeOpacity="0.25" />
                </g>
                <defs>
                    <clipPath id="bgblur_0_485_739_clip_path" transform="translate(10 9.99997)"><path d="M276.8 640C268.367 640 260.552 635.574 256.216 628.341L224.931 576.159C220.595 568.926 212.78 564.5 204.347 564.5L24 564.5C10.7452 564.5 7.53979e-06 553.755 8.69857e-06 540.5L2.33349e-05 24C2.44936e-05 10.7452 10.7452 2.87539e-05 24 2.99126e-05L129.064 3.90977e-05C136.483 3.97462e-05 143.484 3.43034 148.03 9.29228L171.617 39.7078C176.163 45.5697 183.165 49 190.583 49L356 49.0001C369.255 49.0001 380 59.7452 380 73.0001L380 616C380 629.255 369.255 640 356 640L276.8 640Z" />
                    </clipPath></defs>
            </svg>

        )
    }
]